\ работа с трехмерными массивами
\ Калачев А.В. 7.11.2002 diver@forth.org.ru
\ элементы массива - двумерные матрицы
\ Формат массива -      4 - указатель на область памяти содержащий массив
\ Область памяти:  размер  описание
\                  2  -  слоев(lay) 
\                  2  -  размер структуры=====-+
\                  2  -  столбцов(row)       | |
\                  2  -  строк(col)          | } размер структуры (для внутреннего пользования)
\                  n  -  тело матрицы        |_|
\                  .      .                  } по кол-ву слоев (область данных) 
\                  .      .                  |
\                  2  -  столбцов            |
\                  2  -  строк               |
\                  n  -  тело матрицы   _____|
\ структура оставлена для совместимости с матричной библиотекой, дабы не писать лишний раз
\ одни и те же функции. 

S" НеименМатр" SFIND 0= [IF] 2DROP ~diver\matrix\matrix2_1.f [ELSE] DROP [THEN]   
HERE

: НеименМассив ( row col lay -- addr )    \ массив будет единой областью памяти
ROT
2DUP 2>R * смещение* CELL+  \ размер памяти под один слой
OVER >R * CELL+             \ под весь массив  
ALLOCATE THROW              \ .S ." ( \ адрес под массив)" CR 
R@ OVER ! CELL+ addr !      \ запомнили кол-во слоев, в addr - начало области данных 
R> 2R> 2DUP * смещение* CELL+ ( Z Y X Y*X+cm ) 0 SWAP    \ .S ." ( Z Y X 0 Y*X+cm )" CR
4 ROLL 2DUP * addr @ + NIP  ( Y X 0 Y*X+cm Y*X+cm*Z+addr ) 
  addr @ DO 2OVER I W! I 2+ W! DUP +LOOP  \ .S ." ( Y X 0 Y*X+cm )" \ записываем по массиву параметры матриц
addr @ 2- W! DROP 2DROP addr @ CELL- 
;
: слой ( n addr -- addr1 ) \ возвращает адрес n-го слоя 
DUP >R 2+ W@ * R> +  
;
: Элемент? ( row col lay addr --  ) \ !!! стековая нотация зависит от типа данных
слой ВзятьЭлемент                   \ показана общая для всех типов
;
: Элемент! ( row col lay addr --  )
слой ДатьЭлемент 
;

HERE SWAP - \ .( 	matrix_3d.f -- ) . .( bytes) CR
CR .( MATRIX ARRAYS     V1.00          07 November 2002   --  ) . .( bytes) 
\ CR .( MATRIX            V2.21          09 October  2002   --  ) . .( bytes) 
