REQUIRE HEAP-COPY ~ac/lib/ns/heap-copy.f

: EVALUATE, ( addr u -- ) \ компилирует строку в словарь
TRUE STATE ! \ включаем компил€цию
EVALUATE \ выполн€ем строку-параметр
RET, \ заканчиваем определение
STATE 0! \ выключаем компил€цию
;

: EVALUATED ( addr u -- addr-xt u-xt ) \ компилирует строку в словарь, выдаЄт адрес и длину сгенерированного шитого кода
HERE >R
EVALUATE,
HERE \ текущее значение HERE, после компил€ции
R@ DP ! \ восстанавливаем HERE к изначальному значению
R@ \ старое значение HERE, перед ней
( новое старое )
- ( новое-старое ) \ подсчитываем длину скомпилированной последовательности
R> SWAP ;

: EVALUATED-HEAP ( addr u -- xt ) \ компилирует строку в заводимую область в куче
EVALUATED HEAP-COPY ;