REQUIRE состояние ~profit\lib\chartable.f

состояние в-командной-строке
состояние в-кавычках
состояние пропускать-пробелы

пропускать-пробелы
все:  вернуть-букву в-командной-строке ;
разделители:  ;

в-командной-строке
на-входе:  отсюда начать-копить ;
все: копить-дальше ;
символ: " в-кавычках ;
разделители:  остановить-автомат ;
0 выполняет:  остановить-автомат  вернуть-букву ;

в-кавычках
на-входе:  отсюда начать-копить ;
все: копить-дальше ;
0 выполняет: остановить-автомат  вернуть-букву ;
символ: " остановить-автомат ;

: начать-обрабатывать-командную-строку ( str -- )
поставить-курсор  1 TO размер-символа ;

: взять-параметр ( -- a u )
пропускать-пробелы
-1 запустить
общий-накопитель 2@
;

\EOF
: обработать-всю-командную-строку ( str -- ) 
начать-обрабатывать-командную-строку
BEGIN
взять-параметр CR TYPE
отсюда C@ 0=
UNTIL ;

CREATE str 2000 ALLOT
: r 
str 2000 ACCEPT  str курсор-в-тексте ! str + 0 SWAP C!
str обработать-командную-строку ; r