\ /TEST
\ —лово отдел€ющее секцию с проверочным кодом 
\ библиотеки от собственно рабочего кода.

\ ќтличие от \EOF в том что дл€ запуска тестового
\ кода мен€ть исходник библиотеки не надо. ѕросто 
\ запускай его и всЄ. ѕри этом при подключении 
\ библиотеки из других файлов тестовый код не 
\ запускаетс€.

\ “о есть: запускаешь саму библиотеку -- тесты
\ идут. «апускаешь файл, использующий библиотеку,
\ -- тесты не проход€т.


: /TEST INCLUDE-DEPTH @ 1 <> IF \EOF THEN ;


\ $> размечает те строчки которые мы хотим перед 
\ выполнением (в режиме интерпретации) распечатать
\ на экран. Ќазвание выбрано таким дл€ схожести 
\ с приглашением (prompt) какого-нибудь командного 
\ интерпретатора (shell'а).


: $>  0 WORD COUNT CR 2DUP ." $> " TYPE CR EVALUATE ;