\ Константы libc, необходимые при в/в.
\ Ю. Жиловец, 15.05.2007

0 CONSTANT R/O ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "только для чтения"

1 CONSTANT W/O ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "только для записи"

2 CONSTANT R/W ( -- fam ) \ 94 FILE
\ fam - определенное реализацией значение для выбора метода доступа
\ к файлу "чтение/запись"

0 CONSTANT SEEK_SET
1 CONSTANT SEEK_CUR
2 CONSTANT SEEK_END
