\ $Id$
\ Бар ;)
\ Credits: Диалоги украдены из соответствующего плагина для eggdrop

REQUIRE $Revision: ~ygrek/lib/fun/kkv.f
REQUIRE lst( ~ygrek/lib/list/all.f
REQUIRE GENRANDMAX ~ygrek/lib/neilbawd/mersenne.f

MODULE: bot_plugin_bar

\ откуда вытаскивать
lst(
 " достал из холодильника" %
 " вытащил из холодильника" %
 " достал из бара" %
 " вытащил из бара" %
 " взял с полки" %
 " взял со стола" %
 " принес из магазина" %
 " вытащил из тумбочки" %
 " купил" %
 " купил-украл-хотел-отдать-да-только-не-смогли-догнать" %
 " свистнул на базе" %
 " вынул из кармана" %
 " выдернул из лап Микля" %
 " достал из подпола" %
 " заказал на Марсе" %
 " героически отбил у барабанозверя" %
)lst VALUE bar.find

\ метод передачи напитков
lst(
 " и дрожащими лапами, отдал" %
 " и дрожащими руками, протянул" %
 " и дрожащими манипуляторами, передал" %
 " и передал" %
 " и всхлипнув, передал" %
 " и протянул" %
 " и передал" %
 " и торжественно вручил" %
 " и под музыку Вивальди всучил" %
 " и с ухмылочкой на морде втюхал" %
)lst VALUE bar.put

\ нотис юзеру, перед выполнением действия им. Когда юзер заказывает что-то для бота (если bar(botuse) = 1)
lst(
 " Умолять себя дать себе же денег? Это совсем не помогает..." %
 " Я польщен, но я все же сам" %
 " да мне и самому не трудно" %
 " я еще в состоянии последить за собой" %
 " ненадо мне делать одолжений" %
 " мне хватит!" %
 " слушай чувак. ты никогда не забывай... вот кто-то не знает кто-то не врубается кому-то пофиг... вот тока не надо грозить южному централу попивая сок у себя в квартале." %
)lst VALUE bar.notceruser

\ Действия ника (::), при попытке использовать функции бара в сторону бота, от лица бота (если bar(botuse) = 1)
lst(
 " разводит руками, незная что и сказать..." %
 " покраснел от стыда..." %
 " вздыхает с мыслею в голове о своей глупости" %
 " заливается слезами" %
 " в суровом настроении" %
 " обвиняюще смотрит на всех" %
 " стыдливо краснеет..." %
 " краснеет за свою глупость" %
 " испуганно дрожит" %
 " дрожит как осиновый лист" %
 " беспомощно пожимает плечами" %
 " беспомощно пожимает плечами, не зная что и сказать..." %
 " досадно фыркает.." %
 " неодобрительно хмурится.." %
 " охает" %
)lst VALUE bar.erruser

lst(
 " бутылочку пива 'Старый Мельник'" %
 " бутылку пива 'Старый Мельник'" %
 " банку пива 'Старый Мельник'" %
 " бутылочку пива 'LowenBrau'" %
 " бутылку пива 'LowenBrau'" %
 " банку пива 'LowenBrau'" %
 " бутылочку пива 'Солодов'" %
 " бутылку пива 'Солодов'" %
 " банку пива 'Солодов'" %
 " бутылочку пива 'Доктор Дизель'" %
 " бутылку пива 'Доктор Дизель'" %
 " банку пива 'Доктор Дизель'" %
 " бутылочку пива 'Невское'" %
 " бутылку пива 'Невское'" %
 " банку пива 'Невское'" %
 " бутылочку пива 'Три Богатыря'" %
 " бутылку пива 'Три Богатыря'" %
 " банку пива 'Три Богатыря'" %
 " бутылочку пива 'Сибирская Корона'" %
 " бутылку пива 'Сибирская Корона'" %
 " банку пива 'Сибирская Корона'" %
 " бутылочку пива 'Белый Медведь'" %
 " бутылку пива 'Белый Медведь'" %
 " банку пива 'Белый Медведь'" %
 " бутылочку пива 'Клинское'" %
 " бутылку пива 'Клинское'" %
 " банку пива 'Клинское'" %
 " бутылочку пива 'Пит'" %
 " бутылку пива 'Пит'" %
 " банку пива 'Пит'" %
 " бутылочку пива 'EFES Pilsner'" %
 " бутылку пива 'EFES Pilsner'" %
 " банку пива 'EFES Pilsner'" %
 " бутылочку пива 'Клинское REDKOE'" %
 " бутылку пива 'Клинское REDKOE'" %
 " банку пива 'Клинское REDKOE'" %
 " бутылочку пива 'Клинское Самурай'" %
 " бутылочку пива 'Будвайзер'" %
 " бутылку пива 'Будвайзер'" %
 " банку пива 'Будвайзер'" %
 " бутылочку пива 'Балтика'" %
 " бутылку пива 'Балтика'" %
 " банку пива 'Балтика'" %
 " бутылочку пива 'Бочкарев'" %
 " бутылку пива 'Бочкарев'" %
 " банку пива 'Бочкарев'" %
 " бутылочку пива 'Золотая Бочка'" %
 " бутылку пива 'Золотая Бочка'" %
 " банку пива 'Золотая Бочка'" %
 " бутылочку пива 'Tinkoff'" %
 " бутылку пива 'Tinkoff'" %
 " бутылку пива 'Bolotnaya Tina'" %
 " банку пива 'Tinkoff'" %
)lst VALUE bar.drink.pivo

lst(
 " бутылку водки 'Гжелка', налил рюмаху" %
 " бутылку водки 'Русский Размер', плеснул рюмаху" %
 " бутылку водки 'Флагман', налил в румочку" %
 " бутылку водки 'Смирнофф', налил в рюмку" %
 " бутылку водки 'Арбатская', налил в граненый стакан" %
 " бутылку водки 'Кристалл', налил в рюмаху" %
 " бутылку водки 'Юрий Долгорукий', плеснул в рюмаху" %
 " бутылку водки 'Абсолют', аккуратненько налил в рюмочку," %
 " бутылку водки 'Парламент', налил в рюмку" %
 " бутылку водки 'Русский размер', плеснул в рюмку" %
 " пузырь водяры, плеснул в рюмку" %
 " банку самогона, ливанул в рюмку" %
 " паленой водки, накапал в стаканчик" %
 " спиртобензиновой смести, накапал в наперсток" %
 " банку царской водки" %
)lst VALUE bar.drink.vodka

lst(
 " бутылочку воды 'Аква Минерале', налил в стакан" %
 " пол литровую бутылочку воды 'Бон Аква'" %
 " двухлитровую бутылку 'Фанты'" %
 " воду 'Ессентуки'" %
 " кувшин с водой 'Нарзан', налил в бокал" %
 " бутылку воды 'Шишкин лес'" %
 " литровую бутылку воды 'Валдай', налил в стакан" %
 " воду 'Святой источник', налил в кружку" %
 " бутылку воды 'Сенежская', налил в кружку" %
 " бутылочку водички 'Перье', аккуратненько налил в бокал" %
 " воду 'Архыз', плеснул в стакан" %
 " баночку воды 'Pepsi'" %
 " бутылочку воды 'Coca-Cola'" %
 " бутылку воды 'Pepsi', налил в стакан" %
 " бутылку воды 'Coca-Cola', аккуратно налил в стакан" %
 " баночку 'Sprite'" %
 " литровую бутылку воды '7 UP', налил в стакан" %
 " Фанту, налил в бокал" %
)lst VALUE bar.drink.voda

lst(
 " коктейль 'Казанова Дыня'" %
 " баночку коктейля'Казанова'" %
 " банку коктейля 'Трофи Фейхоа'" %
 " коктейл 'Трофи Дыня'" %
 " баночку коктейля 'Трофи'" %
 " коктейль 'МАГДАЛИНА'" %
 " коктейль 'отвертка'" %
 " банку коктейля 'отвертка'" %
 " коктейль 'Bravo'" %
 " коктейль 'Молотов'" %
)lst VALUE bar.drink.kokteil

lst(
 " бутылку вина 'Арбатское', налил бокал" %
 " бутылку вина 'Изабелла', осторожно налил бокал" %
 " вино 'Кагор', аккуратно налил бокал" %
 " бутылку вина 'Кровь Драконa', налил бакал" %
 " вино 'Каберне Крымское', налил бокал" %
 " бутылку вина 'Малезан Божоле', аккуратно налил бокал" %
 " вино 'Малезан Бордо', налил бокал" %
 " бутылку вина 'Бовийон Бордо', осторожно налил бокальчик" %
 " вино 'Кюве Дю Пап', налил бокал" %
 " бутылку вина 'Листель Мерло', осторожно открыл, налил бокал" %
)lst VALUE bar.drink.vino

lst(
 " банку 'Nescafe', вскипятил чайник, приготовил чашечку кофе" %
 " банку 'Nescafe', приготовил чашечку ароматного кофе" %
 " банку кофе 'Jacobs', приготовил чашку" %
 " кофе 'Chibo', приготовил" %
 " 'Маккофе', заварил чашечку" %
 " кофейный напиток 'Утро', заварил бадейку" %
 " любимого Хищнического кофе, отобрал у южноамериканцев" %
)lst VALUE bar.drink.kofe

lst(
 " пачку сока 'Sokos', налил в стакан" %
 " сок 'J-7', аккуратно налил в стакан" %
 " Апельсиновый сок" %
 " пачку Апельсинового сока, налил в стакан" %
 " пачку сока 'Добрый', осторожно налил в бокал" %
 " пачку сока 'Gold Premium', налил в стакан" %
 " сок 'Gold Premium'" %
 " Ананасовй сок, налил в стаканчик" %
 " Яблочный сок, налил в кружку" %
 " сок 'Любимый Сад', налил в стакан" %
 " сок 'Rich', налил в стакан" %
 " сок 'Rich', аккуратно налил в стакан" %
 )lst VALUE bar.drink.sok

lst(
 " коньяк 'Арарат', плеснул рюмку" %
 " бутылку коньяка 'Арарат', аккуратно налил рюмку" %
 " коньяк 'Московский', налил рюмаху" %
 " коньяк 'Арбатский', осторожно налил рюмаху" %
 " бутылку коньяка 'Арбатский', налил рюмку" %
 " бутылку коньяка 'Кремлевский', неспеша налил рюмку " %
 " коньяк 'Бастион', налил рюмочку" %
 " коньяк 'Коровьев', налил в ладошку" %
 " бутылку коньяка 'Курвуазье', аккуратно налил рюмку" %
)lst VALUE bar.drink.koniak

lst(
 " шампанское 'Крымское', налил фужер" %
 " 'Советское' шампанское, аккуратно налил фужер" %
 " бутылку шампанского 'Корнет', налил фужер" %
 " шампанское 'Одесса', осторожно налил фужер" %
 " бутылку 'Асти Мондоро', неспеша налил фужер" %
 " шампанское 'Вдова Клико', налил фужер" %
 " 'Советское' шампанское, налил фужер" %
)lst VALUE bar.drink.shamp

lst(
 " Грузинский чай, заварил кружечку" %
 " чай 'Dilmah', заварил кружку" %
 " чай 'Grinfild', заварил в кружке" %
 " чай 'Милфорд', заварил кружку" %
 " 'Майский' чай, заварил" %
 " 'Принцессу Нури', заварил" %
)lst VALUE bar.drink.tea

: list-get-random-string ( l -- a u ) DUP list::length GENRANDMAX SWAP list::nth list::car STR@ ;

CREATE (ACTION) 1 C, S" ACTION" S,
: ACTION (ACTION) 7 ;
: END_ACTION (ACTION) 1 ;

: give-a-drink { drink-list -- }
    END_ACTION
    current-msg-sender
    bar.put list-get-random-string
    drink-list list-get-random-string
    bar.find list-get-random-string
    ACTION
    " {s} {s} {s} {s} {s}{s}" STR-REPLY ;

: bar: ( n "name" ) CREATE , DOES> @ give-a-drink TRUE TO ?check ;

EXPORT

\ -----------------------------------------------------------------------

MODULE: BOT-COMMANDS-HELP
: !bar S" Try these commands : !pivo !vodka !voda !kokteil !vino !kofe !sok !koniak !shampanskoe !tea" S-REPLY ;
;MODULE

MODULE: BOT-COMMANDS

bar.drink.pivo    bar: !pivo
bar.drink.vodka   bar: !vodka
bar.drink.voda    bar: !voda
bar.drink.kokteil bar: !kokteil
bar.drink.vino    bar: !vino
bar.drink.kofe    bar: !kofe
bar.drink.sok     bar: !sok
bar.drink.koniak  bar: !koniak
bar.drink.shamp   bar: !shampanskoe
bar.drink.tea     bar: !tea

: !barnone S" none!" S-REPLY ;

: !пиво !pivo ;
: !водка !vodka ;
: !лимонад !voda ;
: !вода !voda ;
: !коктейль !kokteil ;
: !вино !vino ;
: !кофе !kofe ;
: !сок !sok ;
: !коньяк !koniak ;
: !шампанское !shampanskoe ;
: !чай !tea ;

\ help
: !bar BOT-COMMANDS-HELP::!bar ;
: !бар !bar ;
: !barhelp !bar ;

: !пиву !barnone ;
: !пива !barnone ;
: !пивко !barnone ;
: !пивка !barnone ;
: !пивасик !barnone ;
: !пив !barnone ;
: !водк !barnone ;
: !водки !barnone ;
: !водку !barnone ;
: !водяра !barnone ;
: !водяры !barnone ;
: !самагон !barnone ;
: !самогон !barnone ;
: !самагону !barnone ;
: !самогону !barnone ;
: !горилка !barnone ;
: !горилки !barnone ;
: !коньяку !barnone ;
: !конья !barnone ;
: !коньячок !barnone ;
: !шампусик !barnone ;
: !шампань !barnone ;
: !водичка !barnone ;
: !сочок !barnone ;
: !сочек !barnone ;
: !виски !barnone ;
: !пить !barnone ;
: !выпить !barnone ;
: !винца !barnone ;
: !винно !barnone ;
: !кофейку !barnone ;
: !чайку !barnone ;
: !чаек !barnone ;
: !бухло !barnone ;

;MODULE \ BOT-COMMANDS

;MODULE \ bot_plugin_bar

$Revision$ " -- Bar plugin {s} loaded." STYPE CR

\ -----------------------------------------------------------------------

\ EOF
