\ 31-05-2007 ~mOleg
\ Copyright [C] 2007 mOleg mininoleg@yahoo.com
\ работа с адресами

 REQUIRE ?DEFINED devel\~moleg\lib\util\ifdef.f
 REQUIRE ALIAS    devel\~moleg\lib\util\alias.f

        \ сколько минимально адресуемых единиц занимает адресная ссылка
        CELL CONSTANT ADDR

ALIAS @ A@ \ извлечь адрес, хранимый по указанному адресу
ALIAS ! A! \ сохранить адресную ссылку по указанному адресу
ALIAS , A, \ компилировать адресную ссылку на вершину кодофайла.

?DEFINED test{ \EOF -- тестовая секция ---------------------------------------

test{
  CREATE aaa HERE A,
  aaa A@ aaa <> THROW
  123456 DUP aaa A! aaa A@ <> THROW
S" passed" TYPE
}test

\EOF
речь идет о некой типизации данных. А именно работа с адресными ссылками
именуется иначе, чем с данными. За счет такого подхода, во-первых, становится
виднее, где идет работа с адресными ссылками, а где идет работа с данными,
а, во-вторых, можно легко поменять размерность адресных ссылок - сделать их
отличными по длинне от CELL. Например, размер адресной ссылки можно сделать
16 битными, а данные будут оставаться 32 битными. Или адреса будут оставаться
32 битными, а данные будут занимать в память 64 бита. Хотя тут остаются
некоторые "грабли" связанные с размерностью стека возвратов, и возможно в
дальнейшем придется делать отдельный набор слов для перемещения на стек
возвратов и обратно адресов: AR> >AR ARDROP и так далее.

\ 05-11-2007  для определения слов использованы алиасы
