\ 2006-12-09

\ коментарии ------------------------------------------------------------------

\ для вывода сообщения о подключаемой секции
\ удобно использовать в начале файла
: \. 0x0A PARSE CR TYPE ;

\ коментарий до конца строки (для временного коментирования кусков кода)
: \? ( --> ) [COMPILE] \ ; IMMEDIATE

\ контекст --------------------------------------------------------------------

\ оставить в контексте только самый верхний словарь
: SEAL CONTEXT @ ONLY CONTEXT ! ;

\ стековые манипуляции --------------------------------------------------------

\ поменять значения данных на вершине стека со значением переменной
: change ( n addr --> [addr] ) DUP @ -ROT ! ;

\ вычислить границы массива заданного своим адресом и длинной
: boudns ( addr # --> up low ) OVER + SWAP ;

\ опустить три значения со стека данных
: 3DROP ( n n n --> ) 2DROP DROP ;

\ логические операции ---------------------------------------------------------

\ Получить по номеру бита его маску
: ?BIT  ( N --> mask ) 1  SWAP LSHIFT ;

\ получить по номеру бита его инверсную маску
: N?BIT ( N --> mask ) ?BIT INVERT ;

\ парсер ----------------------------------------------------------------------

\ слово откатывает >IN назад, на начало непонятого слова
: <back ( ASC # --> ) DROP TIB - >IN ! ;
