@rem 31-05-2007 ~mOleg
@rem Copyright [C] 2007 mOleg mininoleg@yahoo.com
@rem сборка текущей версии СПФ из исходников для CVS

@rem в связи с настоятельной просьбой убрать jpf375c.exe из корня
@rem моих библиотек, а так же с тем, что так и не появилось в CVS архиве
@rem необходимого файла (либо текущей сборки СПФ, либо файла позволяющего
@rem его собрать) добавляется проверка нахождения jpf375c в текущем каталоге
@rem с просьбой его туда скопировать для проведения тестов.
@IF NOT EXIST .\jpf375c.exe ECHO бЄ®ЇЁаг©вҐ Ї®¦ «г©бв  jpf375c.exe ў вҐЄгйЁ© Є в «®Ј
@IF NOT EXIST .\jpf375c.exe EXIT

@copy jpf375c.exe ..\..\..\
@CD ..\..\..\src\
@CALL compile.bat
@del jpf375c.exe

