: MARKER ( "<spaces>name" -- ) \ 94 CORE EXT
\ ѕропустить ведущие пробелы. ¬ыделить name, ограниченное пробелами.
\ —оздать определение с семантикой выполнени€, описанной ниже.
\ name ¬ыполнение: ( -- )
\ ¬осстановить распределение пам€ти словар€ и указатели пор€дка поиска
\ к состо€нию, которое они имели перед определением name. ”брать 
\ определение name и все последующие определени€. Ќе требуетс€ 
\ об€зательно восстанавливать любые оставшиес€ структуры, которые 
\ могут быть св€заны с удаленными определени€ми или освобожденным 
\ пространством данных. Ќикака€ друга€ контекстуальна€ информаци€, 
\ как основание системы счислени€, не измен€етс€.
  HERE
\  [C]HERE , [E]HERE ,
  GET-CURRENT ,
  GET-ORDER DUP , 0 ?DO DUP , @ , LOOP
  CREATE ,
  DOES> @ DUP \ ONLY
\  DUP @ [C]DP ! CELL+
\  DUP @ [E]DP ! CELL+
  DUP @ SET-CURRENT CELL+
  DUP @ >R R@ CELLS 2* + 1 CELLS - R@ 0
  ?DO DUP DUP @ SWAP CELL+ @ OVER ! SWAP 2 CELLS - LOOP
  DROP R> SET-ORDER
  DP !
;
: TUCK ( x1 x2 -- x2 x1 x2 ) \ 94 CORE EXT
\  опировать первый элемент стека (вершину) под второй элемент стека.
  SWAP OVER
;
