\ 15-01-2007 ~moleg

     «агружаем либу,
     запускаем нужный нам процесс
     отчет выводитс€ на экран, и в spf.log
     смотрим в spf.log

     ѕри  входе в двоеточное определение, будет выводитьс€ сообщение
 после  которых  пойдет распечатка стека, при выходе из определени€,
 будет выводитьс€ символ ї. ( если будет много выводов подр€д, то на
 одной строке будет много ї.
      аждое  следующее вложенное определение будет находитьс€ дальше
 на  один  пробел  от  начала строки. ѕон€тно, что, если будет очень
 много уровней вложений, то все выйдет за пределы экрана.

     ѕри  всей  простоте  примера, данный подход может сильно помочь
 найти  проблемное  место.  Ќе стоит использовать данную методику на
 словах,  содержащих  #  #  не  обрамленные  <# .. #> TYPE - так как
 распечатка  стека использует буффер PAD, а так же в словах напр€мую
 работающих со стеком возвратов (если такие определени€ не соблюдают
 баланса  стека  возвратов  на  входе и выходе.) ¬роде все, но могут
 быть еще некоторые нюансы, которые в голову сразу не пришли.
