\ 13-06-2007 ~mOleg

ѕродолжаю наброски комплексного подхода к тестированию библиотек.
–ешил логически разбить на три уровн€:
 1) компил€ци€\исполнение тестирующего кода в зависимости от состо€ни€
    переменной TESTING (smal-test.f)
 2) подключение тестируемых библиотек в режиме тестировани€ (tested.f)
 3) testcase - пока нет подход€щих мыслей по поводу этого уровн€.

¬ tested.f главное слово TESTED подключает в режиме тестировани€ указанную
библиотечку.  онтролируетс€ собираемость указанной либы, состо€ние стека
после подключени€ библиотеки,  изменение системы исчислени€, контекст,
незавершенность двоеточного определени€, изменение текущего словар€.
ќбо всех непри€тност€х сообщаетс€. ƒл€ вложенных библиотек режим тестировани€
отключаетс€.


