REQUIRE /TEST ~profit/lib/testing.f

\ colorlessForth без цвета. Идеи -- Chuck Moore и Terry Loveall.
\ Реализация со словами-префиксами

\ Краткое изложение (из протокола в IRC):
\ Мур всегда упрощал.
\ В последнейшей (по времени) стадии -- это colorForth.
\ Во всех форт системах есть INTERPRET
\ Оно выглядит примерно как как цикл WHILE с BL WORD внутри
\ Каждое слово обрабатывается в зависимости от значения спецпеременной STATE двояко.
\ Ну, это мы знаем..
\ Мур сказал: "Непорядок!.. Убираем STATE и режимы нафик".
\ Теперь остаётся только исполнение.
\ Режимы теперь переносятся непосредственно в текст программы.
\ Как угодно: цветом, префиксами (как у Loveall'а), окончаниями, подчёркивания, как угодно.
\ Слова-префиксы -- самый простой и реализуемый вариант colorForth'а.
\ : square ] DUP ] * ;
\ Означает буквально следущее:
\ "Создать слово square"
\ "Скомпилировать DUP"
\ "Скомпилировать *"
\ "Окончить определение"

\ См. также студенческую статью: http://forth.org.ru/~profit/COLOR4th.pdf

: [ ;            \ "цвет"-префикс исполнения, всегда по-умолчанию, поэтому пропускаются
: ] ' COMPILE, ; \ "цвет"-префикс компиляции
: n LIT, ;       \ "цвет" (не префикс!) компилируемого числа
 
: ;; [COMPILE] ; ; IMMEDIATE
: ; RET, ;
: : CREATE DOES> EXECUTE ;;

\ examples
$> : square  ] DUP  ] *  ;
$> : 2x2  2 n  ] square  ] . ;
$> 2x2