\ Библиотека для вывода числа в различных счислениях на консоль
\ Pretorian 2007

\ Вывести на консоль число в двоичной форме
: .BIN ( n -- n )
	DUP BASE @ 2 BASE ! SWAP . BASE ! ;

\ Вывести на консоль беззнаковое число в двоичной форме
: .UBIN ( n -- n )
	DUP BASE @ 2 BASE ! SWAP U. BASE ! ;

\ Вывести на консоль число в восмеричной форме
: .OCT ( n -- n )
	DUP BASE @ 8 BASE ! SWAP . BASE ! ;

\ Вывести на консоль беззнаковое число в восмеричной форме
: .UOCT ( n -- n )
	DUP BASE @ 8 BASE ! SWAP U. BASE ! ;

\ Вывести на консоль число беззнаковое в десятичной форме
: .DEC ( n -- n )
	DUP BASE @ 10 BASE ! SWAP . BASE ! ;

\ Вывести на консоль беззнаковое число в десятичной форме
: .UDEC ( n -- n )
	DUP BASE @ 10 BASE ! SWAP U. BASE ! ;

\ Вывести на консоль число в шестнадцатиричной форме
: .HEX ( n -- n )
	DUP BASE @ 16 BASE ! SWAP . BASE ! ;

\ Вывести на консоль беззнаковое число в шестнадцатиричной форме
: .UHEX ( n -- n )
	DUP BASE @ 16 BASE ! SWAP U. BASE ! ;

\EOF

.BIN	( n -- n ) - вывести на консоль число в двоичной форме
.UBIN	( n -- n ) - вывести на консоль беззнаковое число в двоичной форме
.OCT	( n -- n ) - вывести на консоль число в восмеричной форме
.UOCT	( n -- n ) - вывести на консоль беззнаковое число в восмеричной форме
.DEC	( n -- n ) - вывести на консоль число в десятичной форме
.DEC	( n -- n ) - вывести на консоль число беззнаковое в десятичной форме
.HEX	( n -- n ) - вывести на консоль число в шестнадцатиричной форме
.UHEX	( n -- n ) - вывести на консоль беззнаковое число в шестнадцатиричной
		форме

