\ -----------------------------------------------------------------------------
\ __          ___       ____ ___
\ \ \        / (_)     |___ \__ \   systime for Windows
\  \ \  /\  / / _ _ __   __) | ) |  pi@alarmomsk.ru
\   \ \/  \/ / | | '_ \ |__ < / /   Получение локального времени
\    \  /\  /  | | | | |___) / /_   Pretorian 2007
\     \/  \/   |_|_| |_|____/____|  v 1.0
\ -----------------------------------------------------------------------------
MODULE: _SYSTIME

WINAPI: GetLocalTime		KERNEL32.DLL

: tTime ( n -> )
	HERE DUP GetLocalTime DROP + W@ ;

EXPORT

\ Текущий год
: Year ( -> n ) 0 tTime ;
	

\ Текущий месяц
: Month ( -> n ) 2 tTime ;

\ Текущий день недели воскресенье-0, понедельник-1 ...
: DayOfWeek  ( -> n ) 4 tTime ;

\ Текущий день месяца
: Day ( -> n ) 6 tTime ;

\ Текущий час
: Hour ( -> n ) 8 tTime ;

\ Текущая минута
: Minute ( -> n ) 10 tTime ;

\ Текущая секунда
: Second ( -> n ) 12 tTime ;

\ Текущая миллисекунда
: Millisecond ( -> n ) 14 tTime ;

\ Вывести на консоль текущую дату
: .DATE ( -> )
	Day 2 .0 0x2E EMIT Month 2 .0 0x2E EMIT Year . ;

\ Вывести на консоль текущее время
: .TIME ( -> )
	Hour 2 .0 0x3A EMIT Minute 2 .0 0x3A EMIT Second 2 .0 ;

\ Вывести на консоль текущую дату и время
: .DATETIME ( -> )
	.DATE .TIME ;

;MODULE


\EOF

Year 		( -> n ) - текущий год
Month 		( -> n ) - текущий месяц
DayOfWeek	( -> n ) - текущий день недели воскресенье-0, понедельник-1 ...
Day		( -> n ) - текущий день месяца
Hour		( -> n ) - текущий час
Minute		( -> n ) - текущая минута
Second		( -> n ) - текущая секунда
Millisecond	( -> n ) - текущая миллисекунда
.DATE		( -> ) - вывести на консоль текущую дату
.TIME		( -> ) - вывести на консоль текущее время
.DATETIME	( -> ) - вывести на консоль текущую дату и время
