\ (c) D. Yakimov [ftech@tula.net]
\ Думаю - получилась неплохая функция хэша
\ И главное быстрая

\ Изменения 25.09.2003, pig
\	* Изменено имя ROL -> (ROL) (конфликт с именами acSMTP)
\	* Синтаксис вызова HASH приведён к ( addr u u1 -- u2 )
\	  с соответствующим изменением семантики
\	  в соответствии с требованиями библиотеки hash_l.f (~yz, ~ruv)
\	* UMOD для правильного ранжирования

: (ROL)  ( u -- u1 )
[ BASE @ HEX
 C1  C, 45  C, 0  C, 1  C,
BASE ! ] ;

: HASH ( addr u u1 -- u2 )
    >R SWAP 2DUP + SWAP			\ цикл по диапазону адресов
    ?DO
      I C@ XOR (ROL)			\ сформировать "большой" индекс хэша
    LOOP
    R> ?DUP IF UMOD THEN		\ привести индекс хэша к нужной размерности
;
