  0
  1 -- DHCP.op      \ Тип сообщения. Может принимать два значения: BOOTREQUEST (1, запрос от клиента к серверу) и BOOTREPLY (2, ответ от сервера к клиенту). 	1
  1 -- DHCP.htype   \ Тип аппаратного адреса. Допустимые значения этого поля определены в RFC <Assigned Numbers>. Например, для MAC-адреса Ethernet 10 Мбит/с это поле принимает значение 1. 	1
  1 -- DHCP.hlen    \ Длина аппаратного адреса в байтах. Для MAC-адреса Ethernet - 6. 	1
  1 -- DHCP.hops    \ Количество промежуточных маршрутизаторов (так называемых агентов ретрансляции DHCP), через которые прошло сообщение. Клиент устанавливает это поле в 0. 	1
  4 -- DHCP.xid     \ Уникальный идентификатор транзакции, генерируемый клиентом в начале процесса получения адреса. 	4
  2 -- DHCP.secs    \ Время в секундах с момента начала процесса получения адреса. Может не использоваться (в этом случае оно устанавливается в 0). 	2
  2 -- DHCP.flags   \ Поле для флагов - специальных параметров протокола DHCP. 	2
  4 -- DHCP.ciaddr  \ IP-адрес клиента. Заполняется только в том случае, если клиент уже имеет собственный IP-адрес и способен отвечать на запросы ARP (это возможно, если клиент выполняет процедуру обновления адреса по истечении срока аренды). 	4
  4 -- DHCP.yiaddr  \ 'your' (client) IP address (RFC 2131) 	4
  4 -- DHCP.siaddr  \ IP-адрес сервера. Возвращается в предложении DHCP (см. ниже). 	4
  4 -- DHCP.giaddr  \ IP-адрес агента ретрансляции, если таковой участвовал в процессе доставки сообщения DHCP до сервера. 	4
 16 -- DHCP.chaddr  \ Аппаратный адрес (обычно MAC-адрес) клиента. 	16
 64 -- DHCP.sname   \ Необязательное имя сервера в виде нуль-терминированной строки. 	64
128 -- DHCP.file    \ Необязательное имя файла на сервере, используемое бездисковыми рабочими станциями при удалённой загрузке. Как и sname, представлено в виде нуль-терминированной строки. 	128
  0 -- DHCP.options \ Поле опций DHCP. Здесь указываются различные дополнительные параметры конфигурации. В начале этого поля указываются четыре особых байта со значениями 99, 130, 83, 99 (<волшебные числа>), позволяющие серверу определить наличие этого поля. 	переменная
CONSTANT /DHCP
